Extensions/src/AccumulationRegisters/ЗапасыНаСкладах/ЗапасыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗапасыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d24f9742-8830-4454-8e1b-e0e396e98a9d">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Extensions/src/InformationRegisters/СотрудникиПользователя/СотрудникиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="757dfba3-fc4f-4273-83b6-a8ae50a685e2">
  <name>СотрудникиПользователя</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="310d5373-bd0f-4c07-9dad-cbc27343c44c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a308f209-e995-4560-a1a3-9c98ac77dbd3">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="281804bc-92a6-4ecf-ba3e-f9df86d13e5e">
  <name>AzRyНапоминанияПользователя</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="48f9c20c-db20-4a73-a582-4b75a82d55a1">
    <name>ВремяСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="08fd23e5-214e-40fd-81af-f737e3b8664c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7106a8fd-cbff-4d1a-a0d1-d6aa54d0d224">
    <name>Автор2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="f995cf7c-8fc1-497a-a9e7-a5c95f9e651d">
    <name>СтатусНапоминания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="23b30069-f9fc-4c3d-87cd-c7476d84b401">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3a4d81cc-ca0e-4435-acfa-28eb8a442652">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e8f11a95-508b-47a2-a724-b27e3fa194c4">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/AccumulationRegisters/ЗапасыНаСкладах/RecordSetModule.bsl
&После("ПриЗаписи")
Процедура РасшAzRy_ПриЗаписи(Отказ, Замещение)
	
	Если Константы.AzRyНапоминанияПользователя.Получить() И ДополнительныеСвойства.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница.AzRyТекущийОтветственный КАК AzRyТекущийОтветственныйФизЛицо,
		|	&ДокСсылка КАК ДокСсылка,
		|	Сотрудники.Ссылка КАК AzRyТекущийОтветственныйСотрудник
		|ПОМЕСТИТЬ вр_Таблица
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ВременнаяТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница.AzRyТекущийОтветственный = Сотрудники.Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вр_Таблица.ДокСсылка КАК ДокСсылка,
		|	вр_Таблица.AzRyТекущийОтветственныйФизЛицо КАК AzRyТекущийОтветственныйФизЛицо,
		|	вр_Таблица.AzRyТекущийОтветственныйСотрудник КАК AzRyТекущийОтветственныйСотрудник,
		|	СотрудникиПользователя.Пользователь КАК AzRyТекущийОтветственный
		|ПОМЕСТИТЬ вр_Таблица2
		|ИЗ
		|	вр_Таблица КАК вр_Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|		ПО вр_Таблица.AzRyТекущийОтветственныйСотрудник = СотрудникиПользователя.Сотрудник
		|ГДЕ
		|	вр_Таблица.AzRyТекущийОтветственныйФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Таблица2.AzRyТекущийОтветственный КАК AzRyТекущийОтветственный,
		|	вр_Таблица2.ДокСсылка КАК ДокСсылка,
		|	ЕСТЬNULL(AzRyНапоминанияПользователя.СтатусНапоминания, НЕОПРЕДЕЛЕНО) КАК СтатусНапоминания,
		|	AzRyНапоминанияПользователя.Получатель КАК Получатель
		|ИЗ
		|	вр_Таблица2 КАК вр_Таблица2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AzRyНапоминанияПользователя КАК AzRyНапоминанияПользователя
		|		ПО вр_Таблица2.ДокСсылка = AzRyНапоминанияПользователя.Источник
		|			И (вр_Таблица2.AzRyТекущийОтветственный = AzRyНапоминанияПользователя.Получатель
		|				ИЛИ вр_Таблица2.AzRyТекущийОтветственный = AzRyНапоминанияПользователя.Отправитель)");
		
		Запрос.УстановитьПараметр("ДокСсылка", Отбор.Регистратор.Значение);
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц; 
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() > 0 И AzRyFunctions.ТаблицаЗначениеЗаполнено(ТЗ, "AzRyТекущийОтветственный") Тогда
			МассивТекущийОтветственный = Новый Массив;
			СоотСтатусНапоминания = Новый Соответствие;
			Для каждого ТекСтрока Из ТЗ Цикл
				//Если ЗначениеЗаполнено(ТекСтрока.AzRyТекущийОтветственный) И ТекСтрока.AzRyТекущийОтветственный <> Пользователи.ТекущийПользователь() Тогда
				Если ЗначениеЗаполнено(ТекСтрока.AzRyТекущийОтветственный) Тогда
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение", Истина);
					//ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRyИсточникВерсияДанных", ТекСтрока.ИсточникВерсияДанных);
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_Получатель", ТекСтрока.Получатель);
					
					МассивТекущийОтветственный.Добавить(ТекСтрока.AzRyТекущийОтветственный);
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_МассивТекущийОтветственный", МассивТекущийОтветственный);
					
					СоотСтатусНапоминания.Вставить(ТекСтрока.AzRyТекущийОтветственный, ТекСтрока.СтатусНапоминания); 
					ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_КешСтатусНапоминания", СоотСтатусНапоминания);
				КонецЕсли; 				
			КонецЦикла; 
		Иначе 	
			ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение", Ложь);		
		КонецЕсли; 		
		
	КонецЕсли; 
	
КонецПроцедуры
